<?php
return [
    'APP_NAME' => '金蚂蚁后台管理系统',
    'USER_TYPE' => [
        1 => '代理商',
        2 => '分销商',
    ],
    'USER_STATUS' => [
        0 => '拉黑',
        1 => '审核中',
        2 => '审核通过',
    ],
    'GRADE_TYPE' => [
        1 => '普通等级',
        2 => '分销商等级',
        3 => '区域代理等级',
        // 2 => '医生',
    ],
    'DISTRIBUTER_TYPE' => [
        1 => '一级',
        2 => '二级',
    ],
    'GRADE_STATUS' => [
        1 => '启用',
        2 => '禁用',
        // 2 => '医生',
    ],
    'CATE_STATUS' => [
        1 => '上架',
        2 => '下架',
    ],
    'PRODUCT_STATUS' => [
        1 => '上架',
        2 => '下架',
        3 => '已售罄',
    ],
    'PRODUCT_CHECK' => [
        1 => '审核中',
        2 => '通过',
        3 => '未通过',
    ],
    'PRODUCT_VE' => [
        1 => '实体商品',
        2 => '虚拟物品',
        3 => '虚拟物品(卡密)',
        4 => '批发商品',
        5 => '计时/次商品',
        6 => '树苗',
        7 => '香榧树',
    ],
    'STORE_STATUS' => [
        1 => '审核中',
        2 => '审核通过',
        3 => '驳回',
    ],
    'ACCOUNTFLOW_TYPE' => [
        0 => '微信支付',
        1 => '微信提现',
    ],
    'MAINTAIN_TYPE' => [
        1 => '退款',
        2 => '换货',
        3 => '退货退款',
    ],
    'MAINTAIN_STATUS' => [
        1 => '申请中',
        2 => '商家处理',
        3 => '客户退回物品',
        4 => '维权成功',
        5 => '维权失败',
    ],
    'ORDER_STATUS' => [
        1 => '待付款',
        2 => '待发货',
        3 => '已发货',
        4 => '已确认',
        5 => '已取消',
        6 => '退换货'
    ],
    'SAPLING_STATUS' => [
        1 => '已付款',
        2 => '已完成',
    ],
    'SAPLING_TYPE' => [
        1 => '领取树苗',
        2 => '香榧树',
    ],
    'ORDER_TYPE' => [
      1 => '现金',
      2 => '微信支付',
      3 => '支付宝支付',
      4 => '其他',
    ],
    'ORDER_OTYPE' => [
        1 => '公益造林',
        2 => '商品订单',
        3 => '旅游订单',
        4 => '充值订单',
        5 => '加盟代理商订单',
    ],
    'ORDER_DELIVERY_TYPE' => [
        1=> '上门自提',
        2=> '店员送货上门',
        3=> '快递送货'
    ],
    'ARTICLE_STATUS' => [
        0 => '隐藏',
        1 => '显示'
    ],
    'BRAND_STATUS' => [
        0 => '隐藏',
        1 => '显示'
    ],
    'ADMINISTRATOR_TYPE' => [
        1 => '财务管理员',
        2 => '仓库管理员',
    ],
    'REBATE_TYPE'=> [
        0 => '其他',
        1 => '下级消费1%',
        2 => '游客消费奖励1级代理商',
        3 => '游客消费奖励2级代理商',
        4 => '余额获得',
        5 => '付款后退出团,退金额',
    ],
    'REBATE_STATUS' => [
        0=> '未提取',
        1=> '已提取',
    ],
    'WITHDRAW_STATUS' => [
        1=> '审核中',
        2=> '已通过',
        3=> '未通过',
    ],
    'WITHDRAW_TYPE' => [
        1=> '支付宝',
        2=> '银行卡',
        3=> '微信',
    ],
    'BARTER_STATUS' => [
        2 => '待发货',
        3 => '已发货',
        4 => '已确认',
        5 => '已取消',
    ],
    'BARTER_DELIVERY_TYPE' => [
        1=> '店员上门自提',
        2=> '送货到门店',
        3=> '快递退货'
    ],
    'CARD_TYPE' => [
        1 => '充值券',
        2 => '消费券',
        3 => '兑换券',
    ],
    'CERT_TYPE' => [
        1 => '权益卡',
        2 => '树权证',
        3 => '收益卡',
    ],
    'PROX_LEVEL' => [
        1 => '1级代理商',
        2 => '2级代理商',
    ],
    'EXC_STATUS' => [
        1 => '兑换中',
        2 => '兑换完成',
    ],
    'UO_STATUS' => [
        0 => '已加入',
        1 => '已进行',
        2 => '已退出',
    ],
    'APPLICATION_STATUS' =>[
        1 => '待审核',
        2 => '审核通过',
        3 => '审核不通过',
    ],
    'USE_CHANCE' => [
        0 => '否',
        1 => '是',
    ],
    'TOURIST_STATUS' => [
        1 => '组织中',
        2 => '已完成',
        3 => '已取消',
    ]
];